/* Задание.
Подумать над структурой класса Ноутбук для магазина техники - выделить поля и методы. Реализовать в java.
Создать множество ноутбуков (Set).
Написать метод, который будет запрашивать у пользователя критерий (или критерии) фильтрации и выведет ноутбуки,
отвечающие фильтру. Критерии фильтрации можно хранить в Map или в Сет.
Например:
Введите цифру, соответствующую необходимому критерию:
1 - цвет
2 - бренд */

public class Main {
    public static void main(String[] args) {
        Program program = new Program();
        program.run();
    }
}
